class Pattern
  TABLE = {
      # 標準50音
      a:  'あ', i: 'い', u: 'う', e: 'え', o: 'お',
      ka: 'か', ki:'き', ku:'く', ke:'け', ko:'こ',
      sa: 'さ', si:'し', su:'す', se:'せ', so:'そ',
      ta: 'た', ti:'ち', tu:'つ', te:'て', to:'と',
      na: 'な', ni:'に', nu:'ぬ', ne:'ね', no:'の',
      ha: 'は', hi:'ひ', hu:'ふ', he:'へ', ho:'ほ',
      ma: 'ま', mi:'み', mu:'む', me:'め', mo:'も',
      ya: 'や',          yu:'ゆ',          yo:'よ',
      ra: 'ら', ri:'り', ru:'る', re:'れ', ro:'ろ',
      wa: 'わ', wi:'ゐ',          we:'ゑ', wo:'を',
      nn: 'ん',

      # 濁音
      vu: 'ゔ',
      ga: 'が', gi:'ぎ', gu:'ぐ', ge:'げ', go:'ご',
      za: 'ざ', zi:'じ', zu:'ず', ze:'ぜ', zo:'ぞ',
      da: 'だ', di:'ぢ', du:'づ', de:'で', do:'ど',
      pa: 'ぱ', pi:'ぴ', pu:'ぷ', pe:'ぺ', po:'ぽ',
      ba: 'ば', bi:'び', bu:'ぶ', be:'べ', bo:'ぼ',

      # 小文字
      la: 'ぁ', li:'ぃ', lu:'ぅ', le:'ぇ', lo:'ぉ',
      ltu: 'っ',
      lya: 'ゃ',         lyu:'ゅ',         lyo:'ょ',
      lka: 'ヵ', lwe:'ゎ',

      # 記号
      :- => 'ー', :"[" => '「', :']' => '」',:','=>'、',:'.'=>'。',
      :~ => '〜', :'/' => '・',
      :'↓' => '↓', :'↑' => '↑',  :'→' => '→', :'←' => '←',
      :'z[' => '『', :'z]' => '』', :'…' => '…', :'‥' => '‥',
      # エイリアス
      yi: 'い', ye: 'え', wu: 'う',
      lyi: 'ぃ', lye: 'ぇ',
      va: 'ゔぁ',vi: 'ゔぃ',ve: 'ゔぇ',vo: 'ゔぉ',
      fa: 'ふぁ',fi: 'ふぃ',fu: 'ふ',  fe: 'ふぇ',fo: 'ふぉ',
  }
end
